dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_reg.h
/**
 * \file IfxSpu_reg.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Spu_Registers_Cfg Spu address
 * \ingroup IfxSfr_Spu_Registers
 * 
 * \defgroup IfxSfr_Spu_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Spu_Registers_Cfg
 *
 * \defgroup IfxSfr_Spu_Registers_Cfg_Spu0 2-SPU0
 * \ingroup IfxSfr_Spu_Registers_Cfg
 *
 * \defgroup IfxSfr_Spu_Registers_Cfg_Spu1 2-SPU1
 * \ingroup IfxSfr_Spu_Registers_Cfg
 *
 *
 */
#ifndef IFXSPU_REG_H
#define IFXSPU_REG_H 1
/******************************************************************************/
#include "IfxSpu_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Spu_Registers_Cfg_BaseAddress
 * \{  */

/** \brief SPU object */
#define MODULE_SPU0 /*lint --e(923, 9078)*/ ((*(Ifx_SPU*)0xFA800000u))
#define MODULE_SPU1 /*lint --e(923, 9078)*/ ((*(Ifx_SPU*)0xFAC00000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_Registers_Cfg_Spu0
 * \{  */
/** \brief 0, Clock Control */
#define SPU0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CLC*)0xFA800000u)

/** \brief 4, Module Identification Register */
#define SPU0_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MODID*)0xFA800004u)

/** \brief 8, Status and Reporting */
#define SPU0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_STAT*)0xFA800008u)

/** \brief 30, Input DMA Configuration */
#define SPU0_ID_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_CONF*)0xFA800030u)

/** \brief 34, Input DMA Configuration 2 */
#define SPU0_ID_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_CONF2*)0xFA800034u)

/** \brief 38, Input DMA Configuration: Radar Memory */
#define SPU0_ID_RM_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_CONF*)0xFA800038u)

/** \brief 3C, Inner Loop Address Offset */
#define SPU0_ID_RM_ILO /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ILO*)0xFA80003Cu)

/** \brief 40, Outer Loop Address Offset */
#define SPU0_ID_RM_OLO /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_OLO*)0xFA800040u)

/** \brief 44, Bin Offset Address Configuration */
#define SPU0_ID_RM_BLO /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_BLO*)0xFA800044u)

/** \brief 48, Inner and Outer Loop Repeat */
#define SPU0_ID_RM_IOLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_IOLR*)0xFA800048u)

/** \brief 4C, Bin Loop Repeat */
#define SPU0_ID_RM_BLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_BLR*)0xFA80004Cu)

/** \brief 50, Spare Configuration Register */
#define SPU0_ID_RM_ACFG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ACFG0*)0xFA800050u)

/** \brief 54, Spare Configuration Register */
#define SPU0_ID_RM_ACFG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ACFG1*)0xFA800054u)

/** \brief 58, Partial-Acquisition Counter */
#define SPU0_PACTR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_PACTR*)0xFA800058u)

/** \brief 5C, Double Pass Configuration */
#define SPU0_DPASS_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_DPASS_CONF*)0xFA80005Cu)

/** \brief 60, Loader Configuration */
#define SPU0_BE0_LDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFA800060u)

/** \brief 64, Loader Configuration Extended */
#define SPU0_BE0_LDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFA800064u)

/** \brief 68, Antenna Offset */
#define SPU0_BE0_ANTOFST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA800068u)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST0.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST0.
*/
#define SPU0_BE0_A0_ANTOFST (SPU0_BE0_ANTOFST0)

/** \brief 6C, Antenna Offset */
#define SPU0_BE0_ANTOFST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA80006Cu)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST1.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST1.
*/
#define SPU0_BE0_A1_ANTOFST (SPU0_BE0_ANTOFST1)

/** \brief 70, Antenna Offset */
#define SPU0_BE0_ANTOFST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA800070u)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST2.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST2.
*/
#define SPU0_BE0_A2_ANTOFST (SPU0_BE0_ANTOFST2)

