dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_reg.h
/** \brief 314, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800314u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT25.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT25.
*/
#define SPU0_MD1_MASK25_ACCEPT (SPU0_MD1_MASK_ACCEPT25)

/** \brief 318, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800318u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT26.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT26.
*/
#define SPU0_MD1_MASK26_ACCEPT (SPU0_MD1_MASK_ACCEPT26)

/** \brief 31C, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80031Cu)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT27.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT27.
*/
#define SPU0_MD1_MASK27_ACCEPT (SPU0_MD1_MASK_ACCEPT27)

/** \brief 320, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800320u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT28.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT28.
*/
#define SPU0_MD1_MASK28_ACCEPT (SPU0_MD1_MASK_ACCEPT28)

/** \brief 324, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800324u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT29.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT29.
*/
#define SPU0_MD1_MASK29_ACCEPT (SPU0_MD1_MASK_ACCEPT29)

/** \brief 328, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800328u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT30.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT30.
*/
#define SPU0_MD1_MASK30_ACCEPT (SPU0_MD1_MASK_ACCEPT30)

/** \brief 32C, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80032Cu)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT31.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT31.
*/
#define SPU0_MD1_MASK31_ACCEPT (SPU0_MD1_MASK_ACCEPT31)

/** \brief 330, Input DMA Count */
#define SPU0_IDMCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_IDMCNT*)0xFA800330u)

/** \brief 334, Input Buffer Memory Count */
#define SPU0_IBMCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_IBMCNT*)0xFA800334u)

/** \brief 338, Input Buffer Memory Read Count */
#define SPU0_LDRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_LDRCNT*)0xFA800338u)

/** \brief 33C, FFT Load Count */
#define SPU0_FFTWCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_FFTWCNT*)0xFA80033Cu)

/** \brief 340, FFT Unload Count */
#define SPU0_FFTRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_FFTRCNT*)0xFA800340u)

/** \brief 344, Output Buffer Memory Write Count */
#define SPU0_ULDRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ULDRCNT*)0xFA800344u)

/** \brief 348, Output Buffer Memory Read Count */
#define SPU0_ODMCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMCNT*)0xFA800348u)

/** \brief 34C, Bin Rejection Unit Load Count */
#define SPU0_BRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BRCNT*)0xFA80034Cu)

/** \brief 350, CFAR Unit Load Count */
#define SPU0_CFARCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFARCNT*)0xFA800350u)

/** \brief 354, Output DMA Port Write Count */
#define SPU0_ODMACNT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA800354u)

/** \brief 358, Output DMA Port Write Count */
#define SPU0_ODMACNT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA800358u)

/** \brief 35C, Output DMA Port Write Count */
#define SPU0_ODMACNT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA80035Cu)

/** \brief 360, Output DMA Port Write Count */
#define SPU0_ODMACNT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA800360u)

/** \brief 364, Output DMA Port Write Count */
#define SPU0_ODMACNT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA800364u)

/** \brief 368, Output DMA Port Write Count */
#define SPU0_ODMACNT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA800368u)

/** \brief 36C, Output DMA Port Write Count */
#define SPU0_ODMACNT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA80036Cu)

/** \brief 370, Output DMA Port Write Count */
#define SPU0_ODMACNT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFA800370u)

/** \brief 374, Safety Counter Clear */
#define SPU0_CNTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CNTCLR*)0xFA800374u)

/** \brief 378, SPU Monitor */
#define SPU0_MONITOR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MONITOR*)0xFA800378u)

/** \brief 37C, Safety Mechanism Control Functions */
#define SPU0_SMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SMCTRL*)0xFA80037Cu)

/** \brief 380, Safety Mechanism Status */
#define SPU0_SMSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SMSTAT*)0xFA800380u)

/** \brief 384, Safety Mechanism Control Functions (User) */
#define SPU0_SMUSER /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SMUSER*)0xFA800384u)

/** \brief 388, Monitor CRC Register */
#define SPU0_CRC_DATA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800388u)
/** Alias (User Manual Name) for SPU0_CRC_DATA0.
* To use register names with standard convension, please use SPU0_CRC_DATA0.
*/
#define SPU0_DATA0_CRC (SPU0_CRC_DATA0)

/** \brief 38C, Monitor CRC Register */
#define SPU0_CRC_DATA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80038Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA1.
* To use register names with standard convension, please use SPU0_CRC_DATA1.
*/
#define SPU0_DATA1_CRC (SPU0_CRC_DATA1)

/** \brief 390, Monitor CRC Register */
#define SPU0_CRC_DATA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800390u)
/** Alias (User Manual Name) for SPU0_CRC_DATA2.
* To use register names with standard convension, please use SPU0_CRC_DATA2.
*/
#define SPU0_DATA2_CRC (SPU0_CRC_DATA2)

/** \brief 394, Monitor CRC Register */
#define SPU0_CRC_DATA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800394u)
/** Alias (User Manual Name) for SPU0_CRC_DATA3.
* To use register names with standard convension, please use SPU0_CRC_DATA3.
*/
#define SPU0_DATA3_CRC (SPU0_CRC_DATA3)

