dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_reg.h
/** \brief 3F4, Monitor CRC Register */
#define SPU0_CRC_DATA27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003F4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA27.
* To use register names with standard convension, please use SPU0_CRC_DATA27.
*/
#define SPU0_DATA27_CRC (SPU0_CRC_DATA27)

/** \brief 3F8, Monitor CRC Register */
#define SPU0_CRC_DATA28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003F8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA28.
* To use register names with standard convension, please use SPU0_CRC_DATA28.
*/
#define SPU0_DATA28_CRC (SPU0_CRC_DATA28)

/** \brief 3FC, Monitor CRC Register */
#define SPU0_CRC_DATA29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003FCu)
/** Alias (User Manual Name) for SPU0_CRC_DATA29.
* To use register names with standard convension, please use SPU0_CRC_DATA29.
*/
#define SPU0_DATA29_CRC (SPU0_CRC_DATA29)

/** \brief 400, Monitor CRC Register */
#define SPU0_CRC_DATA30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800400u)
/** Alias (User Manual Name) for SPU0_CRC_DATA30.
* To use register names with standard convension, please use SPU0_CRC_DATA30.
*/
#define SPU0_DATA30_CRC (SPU0_CRC_DATA30)

/** \brief 404, Monitor CRC Register */
#define SPU0_CRC_DATA31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800404u)
/** Alias (User Manual Name) for SPU0_CRC_DATA31.
* To use register names with standard convension, please use SPU0_CRC_DATA31.
*/
#define SPU0_DATA31_CRC (SPU0_CRC_DATA31)

/** \brief 408, Monitor CRC Register */
#define SPU0_CRC_DATA32 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800408u)
/** Alias (User Manual Name) for SPU0_CRC_DATA32.
* To use register names with standard convension, please use SPU0_CRC_DATA32.
*/
#define SPU0_DATA32_CRC (SPU0_CRC_DATA32)

/** \brief 40C, Monitor CRC Register */
#define SPU0_CRC_DATA33 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80040Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA33.
* To use register names with standard convension, please use SPU0_CRC_DATA33.
*/
#define SPU0_DATA33_CRC (SPU0_CRC_DATA33)

/** \brief 410, Monitor CRC Register */
#define SPU0_CRC_DATA34 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800410u)
/** Alias (User Manual Name) for SPU0_CRC_DATA34.
* To use register names with standard convension, please use SPU0_CRC_DATA34.
*/
#define SPU0_DATA34_CRC (SPU0_CRC_DATA34)

/** \brief 414, Monitor CRC Register */
#define SPU0_CRC_DATA35 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800414u)
/** Alias (User Manual Name) for SPU0_CRC_DATA35.
* To use register names with standard convension, please use SPU0_CRC_DATA35.
*/
#define SPU0_DATA35_CRC (SPU0_CRC_DATA35)

/** \brief 418, Monitor CRC Register */
#define SPU0_CRC_DATA36 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800418u)
/** Alias (User Manual Name) for SPU0_CRC_DATA36.
* To use register names with standard convension, please use SPU0_CRC_DATA36.
*/
#define SPU0_DATA36_CRC (SPU0_CRC_DATA36)

/** \brief 41C, Monitor CRC Register */
#define SPU0_CRC_DATA37 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80041Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA37.
* To use register names with standard convension, please use SPU0_CRC_DATA37.
*/
#define SPU0_DATA37_CRC (SPU0_CRC_DATA37)

/** \brief 420, Monitor CRC Register */
#define SPU0_CRC_DATA38 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800420u)
/** Alias (User Manual Name) for SPU0_CRC_DATA38.
* To use register names with standard convension, please use SPU0_CRC_DATA38.
*/
#define SPU0_DATA38_CRC (SPU0_CRC_DATA38)

/** \brief 424, Monitor CRC Register */
#define SPU0_CRC_DATA39 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800424u)
/** Alias (User Manual Name) for SPU0_CRC_DATA39.
* To use register names with standard convension, please use SPU0_CRC_DATA39.
*/
#define SPU0_DATA39_CRC (SPU0_CRC_DATA39)

/** \brief 428, Monitor CRC Register */
#define SPU0_CRC_DATA40 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800428u)
/** Alias (User Manual Name) for SPU0_CRC_DATA40.
* To use register names with standard convension, please use SPU0_CRC_DATA40.
*/
#define SPU0_DATA40_CRC (SPU0_CRC_DATA40)

/** \brief 42C, Monitor CRC Register */
#define SPU0_CRC_DATA41 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80042Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA41.
* To use register names with standard convension, please use SPU0_CRC_DATA41.
*/
#define SPU0_DATA41_CRC (SPU0_CRC_DATA41)

/** \brief 430, Monitor CRC Register */
#define SPU0_CRC_DATA42 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800430u)
/** Alias (User Manual Name) for SPU0_CRC_DATA42.
* To use register names with standard convension, please use SPU0_CRC_DATA42.
*/
#define SPU0_DATA42_CRC (SPU0_CRC_DATA42)

/** \brief 434, Monitor CRC Register */
#define SPU0_CRC_DATA43 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800434u)
/** Alias (User Manual Name) for SPU0_CRC_DATA43.
* To use register names with standard convension, please use SPU0_CRC_DATA43.
*/
#define SPU0_DATA43_CRC (SPU0_CRC_DATA43)

/** \brief 438, Monitor CRC Register */
#define SPU0_CRC_DATA44 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800438u)
/** Alias (User Manual Name) for SPU0_CRC_DATA44.
* To use register names with standard convension, please use SPU0_CRC_DATA44.
*/
#define SPU0_DATA44_CRC (SPU0_CRC_DATA44)

/** \brief 43C, Monitor CRC Register */
#define SPU0_CRC_DATA45 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80043Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA45.
* To use register names with standard convension, please use SPU0_CRC_DATA45.
*/
#define SPU0_DATA45_CRC (SPU0_CRC_DATA45)

/** \brief 440, Monitor CRC Register */
#define SPU0_CRC_DATA46 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800440u)
/** Alias (User Manual Name) for SPU0_CRC_DATA46.
* To use register names with standard convension, please use SPU0_CRC_DATA46.
*/
#define SPU0_DATA46_CRC (SPU0_CRC_DATA46)

/** \brief 444, Monitor CRC Register */
#define SPU0_CRC_DATA47 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800444u)
/** Alias (User Manual Name) for SPU0_CRC_DATA47.
* To use register names with standard convension, please use SPU0_CRC_DATA47.
*/
#define SPU0_DATA47_CRC (SPU0_CRC_DATA47)

/** \brief 448, Monitor CRC Register */
#define SPU0_CRC_DATA48 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800448u)
/** Alias (User Manual Name) for SPU0_CRC_DATA48.
* To use register names with standard convension, please use SPU0_CRC_DATA48.
*/
#define SPU0_DATA48_CRC (SPU0_CRC_DATA48)

/** \brief 44C, Monitor CRC Register */
#define SPU0_CRC_DATA49 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80044Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA49.
* To use register names with standard convension, please use SPU0_CRC_DATA49.
*/
#define SPU0_DATA49_CRC (SPU0_CRC_DATA49)

