dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_reg.h
/** \brief 450, Monitor CRC Register */
#define SPU0_CRC_DATA50 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800450u)
/** Alias (User Manual Name) for SPU0_CRC_DATA50.
* To use register names with standard convension, please use SPU0_CRC_DATA50.
*/
#define SPU0_DATA50_CRC (SPU0_CRC_DATA50)

/** \brief 454, Monitor CRC Register */
#define SPU0_CRC_DATA51 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800454u)
/** Alias (User Manual Name) for SPU0_CRC_DATA51.
* To use register names with standard convension, please use SPU0_CRC_DATA51.
*/
#define SPU0_DATA51_CRC (SPU0_CRC_DATA51)

/** \brief 458, Monitor CRC Register */
#define SPU0_CRC_DATA52 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800458u)
/** Alias (User Manual Name) for SPU0_CRC_DATA52.
* To use register names with standard convension, please use SPU0_CRC_DATA52.
*/
#define SPU0_DATA52_CRC (SPU0_CRC_DATA52)

/** \brief 45C, Monitor CRC Register */
#define SPU0_CRC_DATA53 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80045Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA53.
* To use register names with standard convension, please use SPU0_CRC_DATA53.
*/
#define SPU0_DATA53_CRC (SPU0_CRC_DATA53)

/** \brief 460, Monitor CRC Register */
#define SPU0_CRC_DATA54 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800460u)
/** Alias (User Manual Name) for SPU0_CRC_DATA54.
* To use register names with standard convension, please use SPU0_CRC_DATA54.
*/
#define SPU0_DATA54_CRC (SPU0_CRC_DATA54)

/** \brief 464, Monitor CRC Register */
#define SPU0_CRC_DATA55 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800464u)
/** Alias (User Manual Name) for SPU0_CRC_DATA55.
* To use register names with standard convension, please use SPU0_CRC_DATA55.
*/
#define SPU0_DATA55_CRC (SPU0_CRC_DATA55)

/** \brief 468, Monitor CRC Register */
#define SPU0_CRC_DATA56 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800468u)
/** Alias (User Manual Name) for SPU0_CRC_DATA56.
* To use register names with standard convension, please use SPU0_CRC_DATA56.
*/
#define SPU0_DATA56_CRC (SPU0_CRC_DATA56)

/** \brief 46C, Monitor CRC Register */
#define SPU0_CRC_DATA57 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80046Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA57.
* To use register names with standard convension, please use SPU0_CRC_DATA57.
*/
#define SPU0_DATA57_CRC (SPU0_CRC_DATA57)

/** \brief 470, Monitor CRC Register */
#define SPU0_CRC_DATA58 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800470u)
/** Alias (User Manual Name) for SPU0_CRC_DATA58.
* To use register names with standard convension, please use SPU0_CRC_DATA58.
*/
#define SPU0_DATA58_CRC (SPU0_CRC_DATA58)

/** \brief 474, Monitor CRC Register */
#define SPU0_CRC_DATA59 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800474u)
/** Alias (User Manual Name) for SPU0_CRC_DATA59.
* To use register names with standard convension, please use SPU0_CRC_DATA59.
*/
#define SPU0_DATA59_CRC (SPU0_CRC_DATA59)

/** \brief 478, Monitor CRC Register */
#define SPU0_CRC_DATA60 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800478u)
/** Alias (User Manual Name) for SPU0_CRC_DATA60.
* To use register names with standard convension, please use SPU0_CRC_DATA60.
*/
#define SPU0_DATA60_CRC (SPU0_CRC_DATA60)

/** \brief 47C, Monitor CRC Register */
#define SPU0_CRC_DATA61 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80047Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA61.
* To use register names with standard convension, please use SPU0_CRC_DATA61.
*/
#define SPU0_DATA61_CRC (SPU0_CRC_DATA61)

/** \brief 480, Monitor CRC Register */
#define SPU0_CRC_DATA62 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800480u)
/** Alias (User Manual Name) for SPU0_CRC_DATA62.
* To use register names with standard convension, please use SPU0_CRC_DATA62.
*/
#define SPU0_DATA62_CRC (SPU0_CRC_DATA62)

/** \brief 484, Monitor CRC Register */
#define SPU0_CRC_DATA63 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800484u)
/** Alias (User Manual Name) for SPU0_CRC_DATA63.
* To use register names with standard convension, please use SPU0_CRC_DATA63.
*/
#define SPU0_DATA63_CRC (SPU0_CRC_DATA63)

/** \brief 488, Monitor CRC Register */
#define SPU0_CRC_DATA64 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800488u)
/** Alias (User Manual Name) for SPU0_CRC_DATA64.
* To use register names with standard convension, please use SPU0_CRC_DATA64.
*/
#define SPU0_DATA64_CRC (SPU0_CRC_DATA64)

/** \brief 48C, Monitor CRC Register */
#define SPU0_CRC_DATA65 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80048Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA65.
* To use register names with standard convension, please use SPU0_CRC_DATA65.
*/
#define SPU0_DATA65_CRC (SPU0_CRC_DATA65)

/** \brief 490, Monitor CRC Register */
#define SPU0_CRC_DATA66 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800490u)
/** Alias (User Manual Name) for SPU0_CRC_DATA66.
* To use register names with standard convension, please use SPU0_CRC_DATA66.
*/
#define SPU0_DATA66_CRC (SPU0_CRC_DATA66)

/** \brief 494, Monitor CRC Register */
#define SPU0_CRC_DATA67 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800494u)
/** Alias (User Manual Name) for SPU0_CRC_DATA67.
* To use register names with standard convension, please use SPU0_CRC_DATA67.
*/
#define SPU0_DATA67_CRC (SPU0_CRC_DATA67)

/** \brief 498, Monitor CRC Register */
#define SPU0_CRC_DATA68 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800498u)
/** Alias (User Manual Name) for SPU0_CRC_DATA68.
* To use register names with standard convension, please use SPU0_CRC_DATA68.
*/
#define SPU0_DATA68_CRC (SPU0_CRC_DATA68)

/** \brief 49C, Monitor CRC Register */
#define SPU0_CRC_DATA69 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80049Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA69.
* To use register names with standard convension, please use SPU0_CRC_DATA69.
*/
#define SPU0_DATA69_CRC (SPU0_CRC_DATA69)

/** \brief 4A0, Monitor CRC Register */
#define SPU0_CRC_DATA70 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004A0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA70.
* To use register names with standard convension, please use SPU0_CRC_DATA70.
*/
#define SPU0_DATA70_CRC (SPU0_CRC_DATA70)

/** \brief 4A4, Monitor CRC Register */
#define SPU0_CRC_DATA71 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004A4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA71.
* To use register names with standard convension, please use SPU0_CRC_DATA71.
*/
#define SPU0_DATA71_CRC (SPU0_CRC_DATA71)

/** \brief 4A8, Monitor CRC Register */
#define SPU0_CRC_DATA72 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004A8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA72.
* To use register names with standard convension, please use SPU0_CRC_DATA72.
*/
#define SPU0_DATA72_CRC (SPU0_CRC_DATA72)

/** \brief 4AC, Monitor CRC Register */
#define SPU0_CRC_DATA73 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004ACu)
/** Alias (User Manual Name) for SPU0_CRC_DATA73.
* To use register names with standard convension, please use SPU0_CRC_DATA73.
*/
#define SPU0_DATA73_CRC (SPU0_CRC_DATA73)

