dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_reg.h
/** \brief 4C, Bin Loop Repeat */
#define SPU1_ID_RM_BLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_BLR*)0xFAC0004Cu)

/** \brief 50, Spare Configuration Register */
#define SPU1_ID_RM_ACFG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ACFG0*)0xFAC00050u)

/** \brief 54, Spare Configuration Register */
#define SPU1_ID_RM_ACFG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ACFG1*)0xFAC00054u)

/** \brief 58, Partial-Acquisition Counter */
#define SPU1_PACTR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_PACTR*)0xFAC00058u)

/** \brief 5C, Double Pass Configuration */
#define SPU1_DPASS_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_DPASS_CONF*)0xFAC0005Cu)

/** \brief 60, Loader Configuration */
#define SPU1_BE0_LDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFAC00060u)

/** \brief 64, Loader Configuration Extended */
#define SPU1_BE0_LDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFAC00064u)

/** \brief 68, Antenna Offset */
#define SPU1_BE0_ANTOFST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC00068u)
/** Alias (User Manual Name) for SPU1_BE0_ANTOFST0.
* To use register names with standard convension, please use SPU1_BE0_ANTOFST0.
*/
#define SPU1_BE0_A0_ANTOFST (SPU1_BE0_ANTOFST0)

/** \brief 6C, Antenna Offset */
#define SPU1_BE0_ANTOFST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC0006Cu)
/** Alias (User Manual Name) for SPU1_BE0_ANTOFST1.
* To use register names with standard convension, please use SPU1_BE0_ANTOFST1.
*/
#define SPU1_BE0_A1_ANTOFST (SPU1_BE0_ANTOFST1)

/** \brief 70, Antenna Offset */
#define SPU1_BE0_ANTOFST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC00070u)
/** Alias (User Manual Name) for SPU1_BE0_ANTOFST2.
* To use register names with standard convension, please use SPU1_BE0_ANTOFST2.
*/
#define SPU1_BE0_A2_ANTOFST (SPU1_BE0_ANTOFST2)

/** \brief 74, Antenna Offset */
#define SPU1_BE0_ANTOFST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC00074u)
/** Alias (User Manual Name) for SPU1_BE0_ANTOFST3.
* To use register names with standard convension, please use SPU1_BE0_ANTOFST3.
*/
#define SPU1_BE0_A3_ANTOFST (SPU1_BE0_ANTOFST3)

/** \brief 78, Unloader Configuration */
#define SPU1_BE0_UNLDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFAC00078u)

/** \brief 7C, Unloader Configuration 2 */
#define SPU1_BE0_UNLDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFAC0007Cu)

/** \brief 80, Spare Configuration Register */
#define SPU1_BE0_UNLDR_ACFG /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_ACFG*)0xFAC00080u)

/** \brief 84, Output Data Processor Configuration */
#define SPU1_BE0_ODP_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFAC00084u)

/** \brief 88, NCI Control */
#define SPU1_BE0_NCICTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFAC00088u)

/** \brief 8C, Summation Unit Control */
#define SPU1_BE0_SUMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFAC0008Cu)

/** \brief 90, Power Summation */
#define SPU1_BE0_PWRSUM /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFAC00090u)

/** \brief 94, Power Information Channel Control */
#define SPU1_BE0_PWRCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFAC00094u)

/** \brief 98, CFAR Module Control */
#define SPU1_BE0_CFARCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFAC00098u)

/** \brief 9C, Sideband Control */
#define SPU1_BE0_SBCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFAC0009Cu)

/** \brief A0, Loader Configuration */
#define SPU1_BE1_LDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFAC000A0u)

/** \brief A4, Loader Configuration Extended */
#define SPU1_BE1_LDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFAC000A4u)

/** \brief A8, Antenna Offset */
#define SPU1_BE1_ANTOFST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC000A8u)
/** Alias (User Manual Name) for SPU1_BE1_ANTOFST0.
* To use register names with standard convension, please use SPU1_BE1_ANTOFST0.
*/
#define SPU1_BE1_A0_ANTOFST (SPU1_BE1_ANTOFST0)

/** \brief AC, Antenna Offset */
#define SPU1_BE1_ANTOFST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC000ACu)
/** Alias (User Manual Name) for SPU1_BE1_ANTOFST1.
* To use register names with standard convension, please use SPU1_BE1_ANTOFST1.
*/
#define SPU1_BE1_A1_ANTOFST (SPU1_BE1_ANTOFST1)

/** \brief B0, Antenna Offset */
#define SPU1_BE1_ANTOFST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC000B0u)
/** Alias (User Manual Name) for SPU1_BE1_ANTOFST2.
* To use register names with standard convension, please use SPU1_BE1_ANTOFST2.
*/
#define SPU1_BE1_A2_ANTOFST (SPU1_BE1_ANTOFST2)

/** \brief B4, Antenna Offset */
#define SPU1_BE1_ANTOFST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFAC000B4u)
/** Alias (User Manual Name) for SPU1_BE1_ANTOFST3.
* To use register names with standard convension, please use SPU1_BE1_ANTOFST3.
*/
#define SPU1_BE1_A3_ANTOFST (SPU1_BE1_ANTOFST3)

/** \brief B8, Unloader Configuration */
#define SPU1_BE1_UNLDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFAC000B8u)

/** \brief BC, Unloader Configuration 2 */
#define SPU1_BE1_UNLDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFAC000BCu)

/** \brief C0, Spare Configuration Register */
#define SPU1_BE1_UNLDR_ACFG /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_ACFG*)0xFAC000C0u)

/** \brief C4, Output Data Processor Configuration */
#define SPU1_BE1_ODP_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFAC000C4u)

/** \brief C8, NCI Control */
#define SPU1_BE1_NCICTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFAC000C8u)

/** \brief CC, Summation Unit Control */
#define SPU1_BE1_SUMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFAC000CCu)

/** \brief D0, Power Summation */
#define SPU1_BE1_PWRSUM /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFAC000D0u)

/** \brief D4, Power Information Channel Control */
#define SPU1_BE1_PWRCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFAC000D4u)

/** \brief D8, CFAR Module Control */
#define SPU1_BE1_CFARCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFAC000D8u)

/** \brief DC, Sideband Control */
#define SPU1_BE1_SBCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFAC000DCu)

/** \brief E0, Bin Rejection Mask */
#define SPU1_BIN_REJ0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000E0u)
/** Alias (User Manual Name) for SPU1_BIN_REJ0.
* To use register names with standard convension, please use SPU1_BIN_REJ0.
*/
#define SPU1_BIN0_REJ (SPU1_BIN_REJ0)

/** \brief E4, Bin Rejection Mask */
#define SPU1_BIN_REJ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000E4u)
/** Alias (User Manual Name) for SPU1_BIN_REJ1.
* To use register names with standard convension, please use SPU1_BIN_REJ1.
*/
#define SPU1_BIN1_REJ (SPU1_BIN_REJ1)

/** \brief E8, Bin Rejection Mask */
#define SPU1_BIN_REJ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000E8u)
/** Alias (User Manual Name) for SPU1_BIN_REJ2.
* To use register names with standard convension, please use SPU1_BIN_REJ2.
*/
#define SPU1_BIN2_REJ (SPU1_BIN_REJ2)

/** \brief EC, Bin Rejection Mask */
#define SPU1_BIN_REJ3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000ECu)
/** Alias (User Manual Name) for SPU1_BIN_REJ3.
* To use register names with standard convension, please use SPU1_BIN_REJ3.
*/
#define SPU1_BIN3_REJ (SPU1_BIN_REJ3)

/** \brief F0, Bin Rejection Mask */
#define SPU1_BIN_REJ4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000F0u)
/** Alias (User Manual Name) for SPU1_BIN_REJ4.
* To use register names with standard convension, please use SPU1_BIN_REJ4.
*/
#define SPU1_BIN4_REJ (SPU1_BIN_REJ4)

/** \brief F4, Bin Rejection Mask */
#define SPU1_BIN_REJ5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000F4u)
/** Alias (User Manual Name) for SPU1_BIN_REJ5.
* To use register names with standard convension, please use SPU1_BIN_REJ5.
*/
#define SPU1_BIN5_REJ (SPU1_BIN_REJ5)

