dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_reg.h
/** \brief 1BC, Bin Rejection Mask */
#define SPU1_BIN_REJ55 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001BCu)
/** Alias (User Manual Name) for SPU1_BIN_REJ55.
* To use register names with standard convension, please use SPU1_BIN_REJ55.
*/
#define SPU1_BIN55_REJ (SPU1_BIN_REJ55)

/** \brief 1C0, Bin Rejection Mask */
#define SPU1_BIN_REJ56 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001C0u)
/** Alias (User Manual Name) for SPU1_BIN_REJ56.
* To use register names with standard convension, please use SPU1_BIN_REJ56.
*/
#define SPU1_BIN56_REJ (SPU1_BIN_REJ56)

/** \brief 1C4, Bin Rejection Mask */
#define SPU1_BIN_REJ57 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001C4u)
/** Alias (User Manual Name) for SPU1_BIN_REJ57.
* To use register names with standard convension, please use SPU1_BIN_REJ57.
*/
#define SPU1_BIN57_REJ (SPU1_BIN_REJ57)

/** \brief 1C8, Bin Rejection Mask */
#define SPU1_BIN_REJ58 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001C8u)
/** Alias (User Manual Name) for SPU1_BIN_REJ58.
* To use register names with standard convension, please use SPU1_BIN_REJ58.
*/
#define SPU1_BIN58_REJ (SPU1_BIN_REJ58)

/** \brief 1CC, Bin Rejection Mask */
#define SPU1_BIN_REJ59 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001CCu)
/** Alias (User Manual Name) for SPU1_BIN_REJ59.
* To use register names with standard convension, please use SPU1_BIN_REJ59.
*/
#define SPU1_BIN59_REJ (SPU1_BIN_REJ59)

/** \brief 1D0, Bin Rejection Mask */
#define SPU1_BIN_REJ60 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001D0u)
/** Alias (User Manual Name) for SPU1_BIN_REJ60.
* To use register names with standard convension, please use SPU1_BIN_REJ60.
*/
#define SPU1_BIN60_REJ (SPU1_BIN_REJ60)

/** \brief 1D4, Bin Rejection Mask */
#define SPU1_BIN_REJ61 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001D4u)
/** Alias (User Manual Name) for SPU1_BIN_REJ61.
* To use register names with standard convension, please use SPU1_BIN_REJ61.
*/
#define SPU1_BIN61_REJ (SPU1_BIN_REJ61)

/** \brief 1D8, Bin Rejection Mask */
#define SPU1_BIN_REJ62 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001D8u)
/** Alias (User Manual Name) for SPU1_BIN_REJ62.
* To use register names with standard convension, please use SPU1_BIN_REJ62.
*/
#define SPU1_BIN62_REJ (SPU1_BIN_REJ62)

/** \brief 1DC, Bin Rejection Mask */
#define SPU1_BIN_REJ63 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001DCu)
/** Alias (User Manual Name) for SPU1_BIN_REJ63.
* To use register names with standard convension, please use SPU1_BIN_REJ63.
*/
#define SPU1_BIN63_REJ (SPU1_BIN_REJ63)

/** \brief 1E0, Magnitude Approximation Constants */
#define SPU1_MAGAPPROX /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MAGAPPROX*)0xFAC001E0u)

/** \brief 1E4, NCI Antennae Scaling Factor */
#define SPU1_NCI_SCALAR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR0*)0xFAC001E4u)
/** Alias (User Manual Name) for SPU1_NCI_SCALAR0.
* To use register names with standard convension, please use SPU1_NCI_SCALAR0.
*/
#define SPU1_NCISCALAR0 (SPU1_NCI_SCALAR0)

/** \brief 1E8, NCI Antennae Scaling Factor */
#define SPU1_NCI_SCALAR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR1*)0xFAC001E8u)
/** Alias (User Manual Name) for SPU1_NCI_SCALAR1.
* To use register names with standard convension, please use SPU1_NCI_SCALAR1.
*/
#define SPU1_NCISCALAR1 (SPU1_NCI_SCALAR1)

/** \brief 1EC, NCI Antennae Scaling Factor */
#define SPU1_NCI_SCALAR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR2*)0xFAC001ECu)
/** Alias (User Manual Name) for SPU1_NCI_SCALAR2.
* To use register names with standard convension, please use SPU1_NCI_SCALAR2.
*/
#define SPU1_NCISCALAR2 (SPU1_NCI_SCALAR2)

/** \brief 1F0, NCI Antennae Scaling Factor */
#define SPU1_NCI_SCALAR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR3*)0xFAC001F0u)
/** Alias (User Manual Name) for SPU1_NCI_SCALAR3.
* To use register names with standard convension, please use SPU1_NCI_SCALAR3.
*/
#define SPU1_NCISCALAR3 (SPU1_NCI_SCALAR3)

/** \brief 1F4, CFAR Configuration */
#define SPU1_CFAR0_CFG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFAR_CFG1*)0xFAC001F4u)
/** Alias (User Manual Name) for SPU1_CFAR0_CFG1.
* To use register names with standard convension, please use SPU1_CFAR0_CFG1.
*/
#define SPU1_CFARCFG (SPU1_CFAR0_CFG1)

/** \brief 1F8, CFAR Configuration 2 */
#define SPU1_CFAR0_CFG2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFAR_CFG2*)0xFAC001F8u)
/** Alias (User Manual Name) for SPU1_CFAR0_CFG2.
* To use register names with standard convension, please use SPU1_CFAR0_CFG2.
*/
#define SPU1_CFARCFG2 (SPU1_CFAR0_CFG2)

/** \brief 1FC, CFAR Configuration 3 */
#define SPU1_CFAR0_CFG3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFAR_CFG3*)0xFAC001FCu)
/** Alias (User Manual Name) for SPU1_CFAR0_CFG3.
* To use register names with standard convension, please use SPU1_CFAR0_CFG3.
*/
#define SPU1_CFARCFG3 (SPU1_CFAR0_CFG3)

/** \brief 200, Scalar Addition Operand */
#define SPU1_SCALARADD /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SCALARADD*)0xFAC00200u)

/** \brief 204, Scalar Multiplication Operand */
#define SPU1_SCALARMULT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SCALARMULT*)0xFAC00204u)

/** \brief 208, Bin Rejection Unit Control */
#define SPU1_BINREJCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BINREJCTRL*)0xFAC00208u)

/** \brief 20C, Local Maximum Control */
#define SPU1_LCLMAX /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_LCLMAX*)0xFAC0020Cu)

/** \brief 210, Spare Configuration Register  */
#define SPU1_ACFG2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ACFG2*)0xFAC00210u)

/** \brief 218, Register CRC */
#define SPU1_REGCRC /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_REGCRC*)0xFAC00218u)

/** \brief 21C, SPU Control */
#define SPU1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CTRL*)0xFAC0021Cu)

/** \brief 220, Dataset Metadata */
#define SPU1_MD0_METADATA /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_METADATA*)0xFAC00220u)

